
# üß© S03 ‚Äì Atelier Packet Tracer

## Objectif
R√©aliser une topologie compl√®te multi-sites entre **Paris** et **Lille** avec interconnexion, routage statique, DHCP et Wi-Fi fonctionnel.  
Le projet repose sur **Cisco Packet Tracer** et vise √† simuler une architecture r√©seau d‚Äôentreprise.

---

## üó∫Ô∏è √âtape 1 ‚Äì Plan d‚Äôadressage

### Exercice : adressage r√©seau

| Site | Sous-r√©seau | Masque | Description |
|------|--------------|--------|--------------|
| Paris / LAN | 192.168.1.0 | /24 | 510 h√¥tes |
| Paris / DMZ | 192.168.3.0 | /24 | Serveurs |
| Paris / WiFi public | 192.168.4.0 | /24 | 1022 h√¥tes |
| Lille / LAN | 192.168.2.0 | /23 | 510 h√¥tes |
| Lille / WiFi public | 192.168.5.0 | /22 | 1022 h√¥tes |

---

## üîå √âtape 2 ‚Äì C√¢blage

Sch√©ma global de l‚Äôinterconnexion entre les deux sites, incluant le VPN, la DMZ et les points d‚Äôacc√®s Wi-Fi.

![Topologie r√©seau](./captures/Pasted%20image%2020251109181100.png)

---

## ‚öôÔ∏è √âtape 3 ‚Äì Configuration des switchs

Exemple sur **Switch3 (Paris)** :

```bash
enable
configure terminal
hostname Switch3
interface Vlan1
ip address 192.168.1.2 255.255.255.0
no shutdown
exit
show ip interface brief
enable secret admin
service password-encryption
copy running-config startup-config
````

M√™me principe appliqu√© √† chaque switch du r√©seau.

![Switch Paris](./captures/Pasted%20image%2020251109170939.png)

---

## üõ†Ô∏è √âtape 4 ‚Äì Configuration initiale des routeurs

Exemple pour **Router Paris** :

```bash
Router>enable
Router#configure terminal
Router(config)#hostname routerParis
Router(config)#enable secret admin

# Interface LAN
Router(config)#int g0/0
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shutdown

# Interface DMZ
Router(config)#int g0/1
Router(config-if)#ip address 192.168.3.1 255.255.255.0
Router(config-if)#no shutdown

# Lien vers Lille
Router(config)#int s0/0/1
Router(config-if)#ip address 92.56.78.1 255.255.255.0
Router(config-if)#no shutdown

# Lien vers DMZ
Router(config)#int s0/0/0
Router(config-if)#ip address 92.12.34.1 255.255.255.0
Router(config-if)#no shutdown

copy running-config startup-config
```

---

## üß≠ √âtape 5 ‚Äì Routage statique

**Router Paris :**

```bash
ip route 192.168.2.0 255.255.255.0 92.12.34.2
copy run sta
```

**Router Lille :**

```bash
ip route 192.168.1.0 255.255.255.0 92.12.34.1
copy run sta
```

**Router DMZ :**

```bash
ip route 192.168.3.0 255.255.255.0 92.12.34.1
```

üì∫ [Vid√©o de r√©f√©rence ‚Äì Routage statique Cisco](https://www.youtube.com/watch?v=v2-DWSyJ4Rg)

---

## üí° √âtape 6 ‚Äì DHCP

Exemple de configuration sur **Router Lille :**

```bash
ip dhcp pool LAN2
network 192.168.2.0 255.255.255.0
dns-server 8.8.8.8
default-router 192.168.2.1
```

> ‚ö†Ô∏è Si le DHCP ne distribue pas correctement les adresses, il faut **renouveler le bail** sur les postes :
>
> ```
> ipconfig /release
> ipconfig /renew
> ```

![Laptop configur√© en DHCP](./captures/Pasted%20image%2020251109120724.png)
![Serveur DHCP central](./captures/Pasted%20image%2020251109182723.png)

üìò R√©f√©rence : [Configurer le service DHCP sur un routeur Cisco ‚Äì IT-Connect](https://www.it-connect.fr/configurer-le-service-dhcp-sur-un-routeur-cisco/)

---

## üì∂ Bonus ‚Äì Configuration Wi-Fi

### Point d‚Äôacc√®s ‚Äì Lille

![Point d‚Äôacc√®s Lille](./captures/Pasted%20image%2020251109182723.png)
![Connexion laptop Wi-Fi](./captures/Pasted%20image%2020251109182505.png)
![Ajout de la carte Wi-Fi](./captures/Pasted%20image%2020251109182422.png)
![R√©seau sans fil configur√©](./captures/Pasted%20image%2020251109182719.png)

**D√©tails :**

* Authentification : WPA2-PSK
* Cl√© : `passwordlille`
* Chiffrement : AES
* Canal : 6
* Port : activ√©

Le laptop est ensuite connect√© en DHCP via Wi-Fi.

---

## üß† M√©ga bonus ‚Äì DHCP centralis√© √† Paris

1. Suppression des anciens pools DHCP sur Paris et Lille :

   ```bash
   no ip dhcp pool LAN1
   no ip dhcp pool LAN2
   ```

2. Ajout des **IP helper-address** :

   ```bash
   interface g0/0
   ip helper-address 192.168.3.20
   ```

   Et c√¥t√© Lille :

   ```bash
   interface g0/0
   ip helper-address 192.168.3.20
   ip helper-address 92.12.34.1
   ```

3. Activation du service DHCP sur le serveur central :

   * Pool **LAN_Paris**
   * Pool **LAN_Lille**
   * DNS : 8.8.8.8
   * Masque : 255.255.255.0

![Serveur DHCP centralis√©](./captures/Pasted%20image%2020251109182723.png)

> Le DHCP centralis√© fonctionne d√©sormais pour les deux sites.

---

## üßæ Conclusion

L‚Äôatelier *Packet Tracer* met en ≈ìuvre :

* le cloisonnement r√©seau entre sites et zones fonctionnelles (LAN, DMZ, Wi-Fi, VPN),
* la configuration compl√®te des √©quipements Cisco,
* la mise en place d‚Äôun **DHCP centralis√©**,
* et la **connectivit√© Wi-Fi s√©curis√©e** via WPA2-PSK.

Le r√©seau est enti√®rement op√©rationnel et respecte les exigences d‚Äôun environnement d‚Äôentreprise segment√© et s√©curis√©.



